; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph5 - mode
	image8 - mode
	infrared7 - mode
	thermograph4 - mode
	thermograph6 - mode
	infrared9 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star1 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared9)
	(supports instrument0 thermograph6)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared7)
	(supports instrument0 image8)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Planet11)
	(have_image Star8 infrared7)
	(have_image Planet9 spectrograph5)
	(have_image Planet9 infrared9)
	(have_image Planet9 infrared7)
	(have_image Planet10 image1)
	(have_image Planet10 thermograph3)
	(have_image Planet11 infrared7)
	(have_image Planet11 infrared9)
	(have_image Star12 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
2. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 10
3. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   goals met: 0 of 10
4. (take_image satellite0 planet9 instrument0 spectrograph5)
   added: (have_image planet9 spectrograph5)
   goals met: 1 of 10
5. (take_image satellite0 planet9 instrument0 infrared9)
   added: (have_image planet9 infrared9)
   goals met: 2 of 10
6. (take_image satellite0 planet9 instrument0 infrared7)
   added: (have_image planet9 infrared7)
   goals met: 3 of 10
7. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 10
8. (take_image satellite0 planet10 instrument0 image1)
   added: (have_image planet10 image1)
   goals met: 4 of 10
9. (take_image satellite0 planet10 instrument0 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 5 of 10
10. (turn_to satellite0 star12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star12)
   goals met: 5 of 10
11. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 6 of 10
12. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 6 of 10
13. (take_image satellite0 star8 instrument0 infrared7)
   added: (have_image star8 infrared7)
   goals met: 7 of 10
14. (turn_to satellite0 planet11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet11)
   goals met: 8 of 10
15. (take_image satellite0 planet11 instrument0 infrared7)
   added: (have_image planet11 infrared7)
   goals met: 9 of 10
16. (take_image satellite0 planet11 instrument0 infrared9)
   added: (have_image planet11 infrared9)
   goals met: 10 of 10
